package ru.nsu.ksadov.blackjack;

/**
 * Значение карты (от двойки до туза).
 */
public enum Value {
    /**
     * Двойка (2).
     */
    TWO(2),
    /**
     * Тройка (3).
     */
    THREE(3),
    /**
     * Четверка (4).
     */
    FOUR(4),
    /**
     * Пятёрка (5).
     */
    FIVE(5),
    /**
     * Шестёрка (6).
     */
    SIX(6),
    /**
     * Семёрка (7).
     */
    SEVEN(7),
    /**
     * Восьмёрка (8).
     */
    EIGHT(8),
    /**
     * Девятка (9).
     */
    NINE(9),
    /**
     * Десятка (10).
     */
    TEN(10),
    /**
     * Валет (J).
     */
    JACK(10),
    /**
     * Дама (Q).
     */
    QUEEN(10),
    /**
     * Король (K).
     */
    KING(10),
    /**
     * Туз (A).
     */
    ACE(11);

    private final int points;

    /**
     * Конструктор значения карты.
     *
     * @param points числовое количество очков для карты
     */
    Value(int points) {
        this.points = points;
    }

    /**
     * Возвращает количество очков, которое приносит карта данного значения.
     *
     * @return очки карты
     */
    public int getPoints() {
        return points;
    }
}
