package ru.nsu.ksadov.blackjack;

/**
 * Значение карты (от двойки до туза).
 */
public enum Value {
    /**
     * Двойка (2).
     */
    TWO,
    /**
     * Тройка (3).
     */
    THREE,
    /**
     * Четверка (4).
     */
    FOUR,
    /**
     * Пятёрка (5).
     */
    FIVE,
    /**
     * Шестёрка (6).
     */
    SIX,
    /**
     * Семёрка (7).
     */
    SEVEN,
    /**
     * Восьмёрка (8).
     */
    EIGHT,
    /**
     * Девятка (9).
     */
    NINE,
    /**
     * Десятка (10).
     */
    TEN,
    /**
     * Валет (J).
     */
    JACK,
    /**
     * Дама (Q).
     */
    QUEEN,
    /**
     * Король (K).
     */
    KING,
    /**
     * Туз (A).
     */
    ACE
}
